In [1]:
import pandas as pd
import numpy as np

In [4]:
titanic_df = pd.read_csv("Titanic_data.csv", nrows=100)

## DataFrame Exploration

In [5]:
titanic_df.shape

(100, 12)

In [6]:
titanic_df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [7]:
titanic_df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [9]:
titanic_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  100 non-null    int64
 1   Survived     100 non-null    int64
 2   Pclass       100 non-null    int64
 3   Name         100 non-null    object
 4   Sex          100 non-null    object
 5   Age          78 non-null     float64
 6   SibSp        100 non-null    int64
 7   Parch        100 non-null    int64
 8   Ticket       100 non-null    object
 9   Fare         100 non-null    float64
 10  Cabin        20 non-null     object
 11  Embarked     99 non-null     object
dtypes: float64(2), int64(5), object(5)
memory usage: 9.5+ KB

In [12]:
titanic_df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

## Specific Information

In [15]:
age = titanic_df['Age']
age

0     22.0
1     38.0
2     26.0
3     35.0
4     35.0
      ...
95     NaN
96    71.0
97    23.0
98    34.0
99    34.0
Name: Age, Length: 100, dtype: float64

* Average Age is 27 which suggests most of the passengers are young adults.
* Mean and Median are nearly equal suggesting a symmetrical distribution

In [16]:
print(age.min())
print(age.max())
print(age.mean())

0.83
71.0
27.46576923076923

**data_frame.describe()**

In [18]:
titanic_df['Age'].describe()

count    78.000000
mean     27.465769
std      15.278878
min       0.830000
25%      18.250000
50%      26.000000
75%      34.750000
max      71.000000
Name: Age, dtype: float64

In [20]:
titanic_df[['Age', 'Fare']].describe()

             Age        Fare
count  78.000000  100.000000
mean   27.465769   29.517625
std    15.278878   40.972905
min     0.830000    7.225000
25%    18.250000    8.050000
50%    26.000000   15.675000
75%    34.750000   32.134375
max    71.000000  263.000000

In [21]:
titanic_df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,100.000000,100.000000,100.000000,78.000000,100.000000,100.000000,100.000000
mean,50.500000,0.410000,2.400000,27.465769,0.730000,0.440000,29.517625
std,29.011492,0.494311,0.816497,15.278878,1.179411,0.967346,40.972905
min,1.000000,0.000000,1.000000,0.830000,0.000000,0.000000,7.225000
25%,25.750000,0.000000,2.000000,18.250000,0.000000,0.000000,8.050000
50%,50.500000,0.000000,3.000000,26.000000,0.000000,0.000000,15.675000
75%,75.250000,1.000000,3.000000,34.750000,1.000000,0.000000,32.134375
max,100.000000,1.000000,3.000000,71.000000,5.000000,5.000000,263.000000

**data_frame.value_counts()**

In [27]:
tdf = pd.read_csv("Titanic_data.csv")

In [28]:
tdf.value_counts("Sex")

Sex
male      577
female    314
dtype: int64

In [29]:
#Percentage
tdf.value_counts("Sex", normalize = True)

Sex
male      0.647587
female    0.352413
dtype: float64

In [30]:
tdf.value_counts("Survived")

Survived
0    549
1    342
dtype: int64

In [33]:
tdf.value_counts("Survived", normalize=True)

Survived
0    0.616162
1    0.383838
dtype: float64

In [36]:
tdf.value_counts([(tdf.Sex == "male") & (tdf.Survived == 1)])

False    782
True     109
dtype: int64

In [37]:
tdf.value_counts([(tdf.Sex == "male") & (tdf.Survived == 1)], normalize=True)

False    0.877666
True     0.122334
dtype: float64

In [40]:
tdf[tdf.Sex == "male"].value_counts('Survived', normalize=True)

Survived
0    0.811092
1    0.188908
dtype: float64

In [41]:
tdf.value_counts(["Sex", "Survived"], normalize=True)

Sex     Survived
male    0           0.525253
female  1           0.261504
male    1           0.122334
female  0           0.090909
dtype: float64

In [42]:
tdf.nunique()

PassengerId    891
Survived         2
Pclass           3
Name           891
Sex              2
Age             88
SibSp            7
Parch            7
Ticket         681
Fare           248
Cabin          147
Embarked         3
dtype: int64

In [43]:
tdf.Embarked.unique()

array(['S', 'C', 'Q', nan], dtype=object)

In [44]:
tdf.Sex.unique()

array(['male', 'female'], dtype=object)